Tekla.Structures.Drawing.TemplateInfo
The TemplateInfo class holds template information.

Tekla.Structures.Drawing.TemplateInfo.Default
The default template information.

Tekla.Structures.Drawing.TemplateInfo.Name
Gets or sets the name of the template file. E.g. "revision".

Tekla.Structures.Drawing.TemplateInfo.#ctor
Creates a new template info instance.

Tekla.Structures.Drawing.TemplateInfo.#ctor(System.String)
Creates a new template info instance with the given template file name.
TemplateFile: The template file name to be used.

Tekla.Structures.Drawing.TemplateInfo.IsEqual(System.Object)
Compares the current object with an object of the same type.
ObjectToCompare: The object to be used for comparing.
Returns: True if all the fields (except for the database GUID) of the objects match.